# Pivoting a DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Created a dataframe by just passing a dictionary 
longframe = pd.DataFrame({'color':['white','white','white','red','red','red','black','black','black'], 'item':['ball','pen','mug','ball','pen','mug','ball','pen','mug'] , 'value' : np.random.rand(9)})
longframe

   color  item     value
0  white  ball  0.695688
1  white   pen  0.469894
2  white   mug  0.663201
3    red  ball  0.870444
4    red   pen  0.333613
5    red   mug  0.000638
6  black  ball  0.015894
7  black   pen  0.341771
8  black   mug  0.057958

In [4]:
df = longframe.pivot(['color', 'item'])
df

TypeError: pivot() takes 1 positional argument but 2 were given

* It pivot the longframe DataFrame by creating a new DataFrame with the unique values of the 'color' column as the index and the unique values of the 'item' column as the columns.
* The values of the pivoted DataFrame will be the corresponding values from the original DataFrame at the intersection of each 'color' and 'item'.

# Manage Duplicate Values in the dataframe

In [5]:
dframe = pd.DataFrame({'color':['white','white','red','red','white'], 'value':[2,1,3,3,2]})
dframe

   color  value
0  white      2
1  white      1
2    red      3
3    red      3
4  white      2

## Identify duplicate Data

In [6]:
# It identifies the rows in which there are duplicate values
dframe.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [7]:
# Total number of duplicate records in the dataframe
dframe.duplicated().sum()

2

## Extraction of duplicate data

In [8]:
dframe[dframe.duplicated()]

   color  value
3    red      3
4  white      2

* Here we have extracted the duplicate data.
* Basically it have extracted those observarions which are corresponding to 'True'

## Drop the duplicate data

In [9]:
dframe.drop_duplicates()

   color  value
0  white      2
1  white      1
2    red      3

# Groupby command in Python

In [15]:
frame = pd.DataFrame({'color' :['white', 'red','green','red','green'] , 'object': ['pen','pencil','pencil','ashtray','pen'],
                      'price1': [5.56, 4.20, 1.30, 0.56, 2.75] , 'price2' : [4.75 , 4.12, 1.60, 0.75, 3.15]})
frame

   color   object  price1  price2
0  white      pen    5.56    4.75
1    red   pencil    4.20    4.12
2  green   pencil    1.30    1.60
3    red  ashtray    0.56    0.75
4  green      pen    2.75    3.15

**2 ways to create group by command**
* var1.groupby(var2) E.g. data[var1].groupby(data[var2])
* [var1,var2].groupby(var_2's label) E.g. data[var1,var2].groupby('var2')

In [11]:
group = frame['price1'].groupby(frame['color'])
group

* Based on the unique values in the column 'color' we have created groups w.r.t the variable 'price1'
* var1.groupby(var2); var1: calcualtion applied on this , var2: groups created based on this

In [12]:
# It provides the size of each groups which we have created.
group.size()

color
green    2
red      2
white    1
Name: price1, dtype: int64

In [14]:
# This is how we apply the summary statistics to the groups
group.sum()

color
green    4.05
red      4.76
white    5.56
Name: price1, dtype: float64

In [16]:
group1 = frame['price1'].groupby('color')

KeyError: 'color'

* It is giving error because according to this code, it will start searching for the column 'color' in the dataframe frame['price1'] which it would not be able to find

In [17]:
group1 = frame[['price1','color']].groupby('color')
group1

* Now the data frame from which in which it is searching for the column 'color' includes the specific column. That is why it is not giving error

In [18]:
group.groups
# It is a dictionary object

{'green': [2, 4], 'red': [1, 3], 'white': [0]}

* the groupby method returns a GroupBy object, which is an intermediate object that allows you to perform various operations on the grouped data.
* One of the properties of a GroupBy object is groups, which is a dictionary where the keys are the unique values in the grouping column(s), and the values are the indices of the original DataFrame that correspond to those values.

In [19]:
# Here we are extracting the keys of the dictionary 
group.groups.keys()

dict_keys(['green', 'red', 'white'])

In [20]:
# It is converting the dict_keys object into the 'list' object
list(group.groups.keys())

['green', 'red', 'white']

In [21]:
group.sum()

color
green    4.05
red      4.76
white    5.56
Name: price1, dtype: float64

In [22]:
group.mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [23]:
# Here we created an efficient code to do the same thing
result1 = frame['price1'].groupby(frame['color']).mean()
result1

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [30]:
# Here we have derived mean value of a variable "price_1" for various categories of color from the df "frame"
frame.groupby(["color"]).price1.mean()
# The resulting object is the pandas series, which ghave colors as index

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [29]:
frame[['price1', 'price2', 'color']].groupby('color').mean()

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

In [31]:
# Extrating separate datasets for each groups
for name , group in frame.groupby('color'):
    print(name)
    print(group)

green
   color  object  price1  price2
2  green  pencil    1.30    1.60
4  green     pen    2.75    3.15
red
  color   object  price1  price2
1   red   pencil    4.20    4.12
3   red  ashtray    0.56    0.75
white
   color object  price1  price2
0  white    pen    5.56    4.75

* name variable stores the name of the group (i.e., the unique value in the 'color' column for that group)
* group variable stores the corresponding subset of the DataFrame that contains all rows with that value.

#### If we want to apply function to all the quantitative variables in our Data Frame with respect to the groups

In [36]:
frame.drop('object' , axis = 1)

   color  price1  price2
0  white    5.56    4.75
1    red    4.20    4.12
2  green    1.30    1.60
3    red    0.56    0.75
4  green    2.75    3.15

In [37]:
frame.drop('object' , axis = 1).groupby('color').mean()

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

In [38]:
# In each column we get the size corresponding to each group 
frame.drop('object' , axis = 1).groupby('color').count()

       price1  price2
color
green       2       2
red         2       2
white       1       1

In [39]:
frame.drop('object' , axis = 1).groupby('color')['price1'].count()

color
green    2
red      2
white    1
Name: price1, dtype: int64

In [40]:
frame.drop('object' , axis = 1).groupby('color').mean().add_prefix('mean_')

       mean_price1  mean_price2
color
green        2.025        2.375
red          2.380        2.435
white        5.560        4.750

In [41]:
# 60 percentile  
frame.drop('object' , axis = 1).groupby('color').quantile(0.6)

       price1  price2
color
green   2.170   2.530
red     2.744   2.772
white   5.560   4.750

#### If we want to apply customize functions on the groups

In [42]:
group = frame['price1'].groupby(frame['color'])

In [43]:
group.groups

{'green': [2, 4], 'red': [1, 3], 'white': [0]}

In [44]:
def range(series):
    return series.max() - series.min()

In [45]:
group.agg(range)

color
green    1.45
red      3.64
white    0.00
Name: price1, dtype: float64

In [46]:
frame['price1'].groupby(frame['color']).agg([range])

       range
color
green   1.45
red     3.64
white   0.00

* Here whatever I am putting inside the 'agg' command that not only just getting executed but that would also become the column name as well

In [47]:
 frame['price1'].groupby(frame['color']).agg([range , 'max' , 'min'])

       range   max   min
color
green   1.45  2.75  1.30
red     3.64  4.20  0.56
white   0.00  5.56  5.56

**Different aggregate function to different variable in the df**

In [48]:
frame.groupby(["color"]).agg({'object':'count' , 'price1':'mean'})

       object  price1
color
green       2   2.025
red         2   2.380
white       1   5.560

* frame.groupby(["color"]) : this creates sub-groups based on the unique values of variable "color" 
* agg({'object':'count' , 'price1':'mean'}) : it applies specific aggregate function to specific variables, and this would applies to each subgroups

# Pandas DataFrame agg() method

* This method aggregates using one or more operations over the specified axis i.e rows or columns.
* It returns Series when DataFrame.agg is called with a single function and DataFrame when DataFrame.agg is called with several functions.

In [ ]:
# Sintax of the function
DataFrame.aggregate(func=None, axis=0, *args, **kwargs)
# func: It is used to aggregate the data. It may be a function, string function name, list of functions, or function name. 
## For example: [np.sum, 'min']
# axis: If 0 or 'index' that applies a function to each column. If 1 or 'columns', that apply a function to each row.
## Default axis value is 0 or 'index'.

In [49]:
frame[['price1','price2']].agg(['count'])

       price1  price2
count       5       5

In [50]:
frame[['price1','price2']].agg(['sum'])

     price1  price2
sum   14.37   14.37

# Transpose a dataframe

In [51]:
import pandas as pd
filepath = "xxx"
df = pd.read_excel(filepath + "Practice_Data.xlsx")
df

           City  Income
0        Manali   10000
1        Shimla   20000
2           Bir   30000
3   Dharamshala   40000
4        Manali   10000
5        Shimla   20000
6           Bir   30000
7   Dharamshala   40000
8        Manali   10000
9        Shimla   20000
10          Bir   30000
11  Dharamshala   40000

In [52]:
# Here we have transposed the dataframe
df.T

,0,1,2,3,4,5,6,7,8,9,10,11
City,Manali,Shimla,Bir,Dharamshala,Manali,Shimla,Bir,Dharamshala,Manali,Shimla,Bir,Dharamshala
Income,10000,20000,30000,40000,10000,20000,30000,40000,10000,20000,30000,40000

# Unique values

In [54]:
# Number of distinct / unique values in the variable "city" of the dataframe "df"
df["City"].nunique()

4

In [55]:
# It gives the list of unique values
df["City"].unique()

array(['Manali', 'Shimla', 'Bir', 'Dharamshala'], dtype=object)

# Frequency distribution of a variable

In [57]:
# Frequency distribution of the variable "City"
df["City"].value_counts()

City
Manali         3
Shimla         3
Bir            3
Dharamshala    3
Name: count, dtype: int64

In [58]:
# Relative frequency distribution of the variable "City"
df["City"].value_counts(normalize = True)

City
Manali         0.25
Shimla         0.25
Bir            0.25
Dharamshala    0.25
Name: proportion, dtype: float64

**Cross relations**

* df['A'].nunique() : Total number of unique values in the variable 'A' in the dataframe 'df' 
* df['A'].unique() : List of unique values in the variable 'A' in the dataframe 'df'
* df['A'].value_counts() : it gives the frequency distribution of the variable 'A' in the dataframe 'df'